DesconBelgrade/Klimerko/Klimerko_Firmware/src/AllThingsTalk/ATT_ESP8266.h
/*    _   _ _ _____ _    _              _____     _ _     ___ ___  _  __
 *   /_\ | | |_   _| |_ (_)_ _  __ _ __|_   _|_ _| | |__ / __|   \| |/ /
 *  / _ \| | | | | | ' \| | ' \/ _` (_-< | |/ _` | | / / \__ \ |) | ' <
 * /_/ \_\_|_| |_| |_||_|_|_||_\__, /__/ |_|\__,_|_|_\_\ |___/___/|_|\_\
 *                             |___/
 *
 * Copyright 2019 AllThingsTalk
 * Author: Vanja
 * https://allthingstalk.com
 * 
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * This library makes connecting your Arduino devices with your AllThingsTalk Maker
 * a breeze, but it has quite a few more tricks up its sleeve.
 * Detailed instructions for this library can be found: https://github.com/allthingstalk/arduino-wifi-sdk
 */

#include <Ticker.h>
#include <ESP8266WiFi.h>

WiFiClient wifiClient;
PubSubClient client(wifiClient);
Ticker fader;

// Constructor
Device::Device(WifiCredentials &wifiCreds, DeviceConfig &deviceCreds) {
    this->deviceCreds = &deviceCreds;
    this->wifiCreds = &wifiCreds;
}

// Serial print (debugging)
template<typename T> void Device::debug(T message, char separator) {
    if (debugSerial) {
        debugSerial->print(message);
        if (separator) {
            debugSerial->print(separator);
        }
    }
}

// Serial print (verbose debugging)
template<typename T> void Device::debugVerbose(T message, char separator) {
    if (debugVerboseEnabled) {
        if (debugSerial) {
            debugSerial->print(message);
            if (separator) {
                debugSerial->print(separator);
            }
        }
    }
}

// Start fading the Connection LED
void Device::connectionLedFadeStart() {
    if (ledEnabled == true) {
        if (fader.active() == false) {
            fader.attach_ms(1, std::bind(&Device::connectionLedFadeStart, this));
        } else {
            unsigned long thisMillis = millis();
            if (thisMillis - previousFadeMillis >= fadeInterval) {
                if (fadeDirection == UP) {
                    fadeValue = fadeValue + fadeIncrement;
                    if (fadeValue >= maxPWM) {
                        fadeValue = maxPWM;
                        fadeDirection = DOWN;
                    }
            } else {
                fadeValue = fadeValue - fadeIncrement;
                if (fadeValue <= minPWM) {
                    fadeValue = minPWM;
                    fadeDirection = UP;
                }
            }
            analogWrite(connectionLedPin, fadeValue);
            previousFadeMillis = thisMillis;
            }
        }
    }
}

// Stop the Connection LED
void Device::connectionLedFadeStop() {
    if (ledEnabled == true) {
        fader.detach();
        while (fadeValue <= maxPWM) {
            delay(fadeInterval);
            fadeValue = fadeValue + fadeIncrement;
            analogWrite(connectionLedPin, fadeValue);
        }
        fadeValue = maxPWM;
        for (int i=0; i<=1; i++) {
            delay(100);
            analogWrite(connectionLedPin, minPWM);
            delay(50);
            analogWrite(connectionLedPin, maxPWM);
        }
    }
}

// Used to check if wifiSignalReporting is enabled
bool Device::wifiSignalReporting() {
    if (rssiReporting) {
        return true;
    } else {
        return false;
    }
}

// Used to set wifiSignalReporting on/off
bool Device::wifiSignalReporting(bool state) {
    rssiReporting = state;
    return true;
}

// Used to set wifiSignalReporting interval
bool Device::wifiSignalReporting(int time) {
    rssiReportInterval = time;
    return true;
}

// Used to set wifiSignalReporting on/off and interval in one go
bool Device::wifiSignalReporting(bool state, int time) {
    rssiReportInterval = time;
    rssiReporting = state;
    return true;
}

// Used to check if connectionLed is enabled or disabled
bool Device::connectionLed() {
    if (ledEnabled) {
        return true;
    } else {
        return false;
    }
}

// Used to set connectionLed on/off
bool Device::connectionLed(bool state) {
    ledEnabled = state;
    return true;
}

// Used to set a custom pin for connectionLed
bool Device::connectionLed(int ledPin) {
    connectionLedPin = ledPin;
    return true;
}

// Used to set connectionLed on/off and custom pin in one go
bool Device::connectionLed(bool state, int ledPin) {
    connectionLedPin = ledPin;
    ledEnabled = state;
    return true;
}

// Used to enable debug output
void Device::debugPort(Stream &debugSerial) {
    this->debugSerial = &debugSerial;
    debug("");
    debug("------------- AllThingsTalk WiFi SDK Serial Begin -------------");
    debug("Debug Level: Normal");
}

// Used to enable verbose debug output
void Device::debugPort(Stream &debugSerial, bool verbose) {
    debugVerboseEnabled = verbose;
    this->debugSerial = &debugSerial;
    debug("");
    debug("------------- AllThingsTalk WiFi SDK Serial Begin -------------");
    if (!verbose) debug("Debug Level: Normal");
    debugVerbose("Debug Level: Verbose");
    
}

// Generate Unique MQTT ID
void Device::generateRandomID() {
    sprintf(mqttId, "%s%i", "arduino-", ESP.getChipId());
    debugVerbose("Unique MQTT ID of Device:", ' ');
    debugVerbose(mqttId);
}

// Shows Device ID and Device Token via Serial in a hidden way (for visual verification)
void Device::showMaskedCredentials() {
    if (debugVerboseEnabled) {
        String hiddenDeviceId = deviceCreds->getDeviceId();
        String hiddenDeviceToken = deviceCreds->getDeviceToken();
        String lastFourDeviceId = hiddenDeviceId.substring(20);
        String lastFourDeviceToken = hiddenDeviceToken.substring(41);
        hiddenDeviceId = hiddenDeviceId.substring(0, 4);
        hiddenDeviceToken = hiddenDeviceToken.substring(0, 10);
        hiddenDeviceId += "****************";
        hiddenDeviceId += lastFourDeviceId;
        hiddenDeviceToken += "*******************************";
        hiddenDeviceToken += lastFourDeviceToken;
        debugVerbose("API Endpoint:", ' ');
        debugVerbose(deviceCreds->getHostname());
        debugVerbose("Device ID:", ' ');
        debugVerbose(hiddenDeviceId);
        debugVerbose("Device Token:", ' ');
        debugVerbose(hiddenDeviceToken);
    }
}

// Initialization of everything. Run in setup(), only after defining everything else.
void Device::init() {
    // Start flashing the Connection LED
    connectionLedFadeStart();
    
    // Print out information about Connection LED
    if (ledEnabled == false) {
        debug("Connection LED: Disabled");
    } else {
        debug("Connection LED: Enabled - GPIO", ' ');
        debug(connectionLedPin);
        debugVerbose("Please don't use GPIO", ' ');
        debugVerbose(connectionLedPin, ' ');
        debugVerbose("as it's used for Connection LED");
    }
    
    // Print out information about WiFi Signal Reporting
    if (rssiReporting == false) {
        debug("WiFi Signal Reporting: Disabled");
    } else {
        debug("WiFi Signal Reporting: Enabled");
        debugVerbose("WiFi Signal Strength will be published every", ' ');
        debugVerbose(rssiReportInterval, ' ');
        debugVerbose("seconds to 'wifi-signal' asset (will be created automatically)");
        createAsset("wifi-signal", "WiFi Signal Strength", "sensor", "string");
    }

