DesconBelgrade/Klimerko/Klimerko_Firmware/src/AllThingsTalk/ATT_ESP8266.h
    // Generate MQTT ID
    generateRandomID();

    // Print out the Device ID and Device Token in a hidden way (for visual verification)
    showMaskedCredentials();

    // Set MQTT Connection Parameters
    client.setServer(deviceCreds->getHostname(), 1883);
    if (callbackEnabled == true) {
        client.setCallback([this] (char* topic, byte* payload, unsigned int length) { this->mqttCallback(topic, payload, length); });
    }
    
    // Connect to WiFi and AllThingsTalk
    connectWiFi();
    createAssets();
    connectAllThingsTalk();
}

// Needs to be run in program loop in order to keep connections alive
void Device::loop() {
    maintainWiFi();
    client.loop();
    reportWiFiSignal();
    maintainAllThingsTalk();
}

// Connect to both WiFi and ATT
void Device::connect() {
    debug("Connecting to both WiFi and AllThingsTalk...");
    connectWiFi();
    connectAllThingsTalk();
}

// Disconnect both WiFi and ATT
void Device::disconnect() {
    debug("Disconnecting from both AllThingsTalk and WiFi...");
    disconnectAllThingsTalk();
    disconnectWiFi();
}

// Main method to connect to WiFi
void Device::connectWiFi() {
    if (WiFi.status() != WL_CONNECTED) {
        connectionLedFadeStart();
        WiFi.mode(WIFI_STA);
        if (wifiHostnameSet) {
            WiFi.hostname(wifiHostname);
            debugVerbose("WiFi Hostname:", ' ');
            debugVerbose(wifiHostname);
        }
        debug("Connecting to WiFi:", ' ');
        debug(wifiCreds->getSsid(), '.');
        WiFi.begin(wifiCreds->getSsid(), wifiCreds->getPassword());
        while (WiFi.status() != WL_CONNECTED) {
            debug("", '.');
            delay(10000);
        }
        debug("");
        debug("Connected to WiFi!");
        connectionLedFadeStop();
        debugVerbose("IP Address:", ' ');
        debugVerbose(WiFi.localIP());
        debugVerbose("WiFi Signal:", ' ');
        debugVerbose(wifiSignal());
        disconnectedWiFi = false;
    }
}

// Checks and recovers WiFi if lost
void Device::maintainWiFi() {
    if (!disconnectedWiFi) {
        if (WiFi.status() != WL_CONNECTED) {
            connectionLedFadeStart();
            debug("WiFi Connection Dropped! Reason:", ' ');
            switch(WiFi.status()) {
                case 1:
                    debug("Seems like WiFi is connected, but it's giving an error (WL_CONNECTED)");
                    break;
                case 2:
                    debug("No WiFi Shield Present (WL_NO_SHIELD)");
                    break;
                case 3:
                    debug("WiFi.begin is currently trying to connect... (WL_IDLE_STATUS)");
                    break;
                case 4:
                    debug("SSID Not Available (WL_NO_SSID_AVAIL)");
                    break;
                case 5:
                    debug("WiFi Scan Completed (WL_SCAN_COMPLETED)");
                    break;
                case 6:
                    debug("Connection lost and failed to connect after many attempts (WL_CONNECT_FAILED)");
                    break;
                case 7:
                    debug("Connection Lost (WL_CONNECTION_LOST)");
                    break;
                case 8:
                    debug("Intentionally disconnected from the network (WL_DISCONNECTED)");
                    break;
                default:
                    debug("Unknown");
                    break;
            }
            connectWiFi();
            if (!disconnectedAllThingsTalk) {
                connectAllThingsTalk();
            }
        }
    }
}

// Main method for disconnecting from WiFi
void Device::disconnectWiFi() {
    if (WiFi.status() == WL_CONNECTED) {
        disconnectAllThingsTalk();
        WiFi.disconnect();
        disconnectedWiFi = true;
        while (WiFi.status() == WL_CONNECTED) {
            delay(1000);
        }
        debug("Successfully Disconnected from WiFi");
    }
}

// Used to set hostname that the device will present itself as on the network
bool Device::setHostname(String hostname) {
    wifiHostname = hostname;
    wifiHostnameSet = true;
    return true;
}

// Used to connect to HTTP (for asset creation)
bool Device::connectHttp() {
    if (!(wifiClient.connect(deviceCreds->getHostname(), 80))) {
        debug("Your Asset(s) can't be created on AllThingsTalk because the HTTP Connection failed.");
        return false;
    } else {
        return true;
    }
}

// Used to disconnect HTTP (for asset creation)
void Device::disconnectHttp() {
    wifiClient.flush();
    wifiClient.stop();
    debugVerbose("HTTP Connection (for Asset creation) to AllThingsTalk Closed");
}

// Used by the user to create a new asset on AllThingsTalk
bool Device::createAsset(String name, String title, String assetType, String dataType) {
    if (assetType == "sensor" || assetType == "actuator" || assetType == "virtual") {
    } else {
        String output = "Asset '" + name + "' (" + title + ") will not be created on AllThingTalk because it has an invalid asset type '" + assetType + "'.";
        debug(output);
        return false;
    }
    if (dataType == "boolean" || dataType == "string" || dataType == "integer" || dataType == "number" || dataType == "object" ||dataType == "array" ||  dataType == "location") {
    } else {
        String output = "Asset '" + name + "' (" + title + ") will not be created on AllThingTalk because it has an invalid data type '" + dataType + "'.";
        debug(output);
        return false;
    }
    
    assetsToCreate = true;
    assetProperties[assetsToCreateCount].name = name;
    assetProperties[assetsToCreateCount].title = title;
    assetProperties[assetsToCreateCount].assetType = assetType;
    assetProperties[assetsToCreateCount].dataType = dataType;
    ++assetsToCreateCount;
}

// Used by the SDK to actually create all the assets requested by user
AssetProperty *Device::createAssets() {
    if (assetsToCreate && connectHttp()) {
        connectionLedFadeStart();
        for (int i=0; i < assetsToCreateCount; i++) {
            connectHttp();
            wifiClient.println("PUT /device/" + String(deviceCreds->getDeviceId()) + "/asset/" + assetProperties[i].name  + " HTTP/1.1");
            wifiClient.print(F("Host: "));
            wifiClient.println(deviceCreds->getHostname());
            wifiClient.println(F("Content-Type: application/json"));
            wifiClient.print(F("Authorization: Bearer "));
            wifiClient.println(deviceCreds->getDeviceToken());
            wifiClient.print(F("Content-Length: ")); {
                int length = assetProperties[i].title.length() + assetProperties[i].dataType.length();
                
