DesconBelgrade/Klimerko/Klimerko_Firmware/src/AllThingsTalk/ATT_ESP8266.h
                if(assetProperties[i].assetType.equals("sensor")) {
                    length += 6;
                } else if(assetProperties[i].assetType.equals("actuator")) {
                    length += 8;
                } else if(assetProperties[i].assetType.equals("virtual")) {
                    length += 7;
                }

                if (assetProperties[i].dataType.length() == 0) {
                    length += 39;
                } else if (assetProperties[i].dataType[0] == '{') {
                    length += 49;
                } else {
                    length += 62;
                }
                wifiClient.println(length);
            }
            wifiClient.println();
            wifiClient.print(F("{\"title\":\""));
            wifiClient.print(assetProperties[i].title);
            wifiClient.print(F("\",\"is\":\""));
            wifiClient.print(assetProperties[i].assetType);
            if(assetProperties[i].dataType.length() == 0) {
                wifiClient.print(F("\""));
            } else if(assetProperties[i].dataType[0] == '{') {
                wifiClient.print(F("\",\"profile\": "));
                wifiClient.print(assetProperties[i].dataType);
            } else {
                wifiClient.print(F("\",\"profile\": { \"type\":\""));
                wifiClient.print(assetProperties[i].dataType);
                wifiClient.print(F("\" }"));
            }
            wifiClient.print(F("}"));
            wifiClient.println();
            wifiClient.println();
            
            unsigned long maxTime = millis() + 1000;
            while (millis() < maxTime) {
                if (wifiClient.available()) {
                    break;
                } else {
                    delay(10);
                }
            }
            
            if (debugVerboseEnabled) {
                if (wifiClient.available()) {
                    String response;
                    debugVerbose("---------------- HTTP Response from AllThingsTalk (Begin) ----------------");
                    while (wifiClient.available()) {
                        char c = wifiClient.read();
                        response += c;
                    }
                    debugVerbose(response);
                    debugVerbose("----------------- HTTP Response from AllThingsTalk (End) -----------------");
                }
            } else {
                if (wifiClient.available()) {
                    String output;
                    while (wifiClient.available()) { // This is of dubious value.
                        if (!wifiClient.find("HTTP/1.1")) {
                            break;
                        }
                        int responseCode = wifiClient.parseInt();
                        switch (responseCode) {
                            case 200:
                                output = "Updated existing " + assetProperties[i].dataType + " " + assetProperties[i].assetType + " asset '" + assetProperties[i].name + "' (" + assetProperties[i].title + ") on AllThingsTalk";
                                debug(output);
                                break;
                            case 201:
                                output = "Created a " + assetProperties[i].dataType + " " + assetProperties[i].assetType + " asset '" + assetProperties[i].name + "' (" + assetProperties[i].title + ") on AllThingsTalk";
                                debug(output);
                                break;
                            default:
                                output = "Failed to create a " + assetProperties[i].dataType + " " + assetProperties[i].assetType + " asset '" + assetProperties[i].name + "' (" + assetProperties[i].title + ") on AllThingsTalk. HTTP Response Code: " + responseCode;
                                debug(output);
                                break;
                        }
                        break;
                    }
                }
            }
        }
        disconnectHttp();
    }
}

// Connect to AllThingsTalk (and WiFi if it's disconnected)
void Device::connectAllThingsTalk() {
    if (!client.connected()) {
        connectionLedFadeStart();
        connectWiFi(); // WiFi needs to be present of course
        debug("Connecting to AllThingsTalk", '.');
        while (!client.connected()) {
            if (WiFi.status() != WL_CONNECTED) {
                debug(" "); // Cosmetic only.
                maintainWiFi(); // In case WiFi connection is lost while connecting to ATT
            }
            if (!client.connected()) { // Double check while running to avoid double debug output (because maintainWiFi() also calls this method if ATT isn't connected)
                if (client.connect(mqttId, deviceCreds->getDeviceToken(), "arbitrary")) {
                    if (callbackEnabled == true) {
                        // Build the subscribe topic
                        char command_topic[256];
                        snprintf(command_topic, sizeof command_topic, "%s%s%s", "device/", deviceCreds->getDeviceId(), "/asset/+/command");
                        client.subscribe(command_topic); // Subscribe to it
                    }
                    disconnectedAllThingsTalk = false;
                    debug("");
                    debug("Connected to AllThingsTalk!");
                    connectionLedFadeStop();
                    if (rssiReporting) send(wifiSignalAsset, wifiSignal()); // Send WiFi Signal Strength upon connecting
                } else {
                    debug("", '.');
                    delay(1500);
                }
            }                   
        }
    }
}

// Used to monitor AllThingsTalk connection and reconnect if dropped
void Device::maintainAllThingsTalk() {
    if (!disconnectedAllThingsTalk) {
        if (!client.connected()) {
            connectionLedFadeStart();
            debug("AllThingsTalk Connection Dropped! Reason:", ' ');
            switch (client.state()) {
                case -4:
                    debug("Server didn't respond within the keepalive time");
                    break;
                case -3:
                    debug("Network connection was broken");
                    break;
                case -2:
                    debug("Network connection failed.");
                    debugVerbose("This is a general error. Check if the asset you're publishing to exists on AllThingsTalk.");
                    break;
                case -1:
                    debug("Client disconnected cleanly (intentionally)");
                    break;
                case 0:
                    debug("Seems like client is connected. Restart device.");
                    break;
                case 1:
                    debug("Server doesn't support the requested protocol version");
                    break;
                case 2:
                    debug("Server rejected the client identifier");
                    break;
                case 3:
                    debug("Server was unable to accept the connection");
                    break;
                case 4:
                    debug("Bad username or password");
                    break;
                case 5:
                    debug("Client not authorized to connect");
                    break;
                default:
                    debug("Unknown");
                    break;
            }
            connectAllThingsTalk();
        }
    }
}

// Used to disconnect from AllThingsTalk
void Device::disconnectAllThingsTalk() {
    if (client.connected()) {
        client.disconnect();
        disconnectedAllThingsTalk = true;
        while (client.connected()) {}
        if (!client.connected()) {
            debug("Successfully Disconnected from AllThingsTalk");
        } else {
            debug("Failed to disconnect from AllThingsTalk");
        }
    }
}

// Called from loop; Reports wifi signal to ATTalk Maker at specified interval
void Device::reportWiFiSignal() {
    if (rssiReporting && WiFi.status() == WL_CONNECTED) {
        if (millis() - rssiPrevTime >= rssiReportInterval*1000) {
            send(wifiSignalAsset, wifiSignal());
            rssiPrevTime = millis();
        }
    }
}

