DesconBelgrade/Klimerko/Klimerko_Firmware/src/AllThingsTalk/ATT_ESP8266.h
    // INTEGER
    if (actuationCallback->actuationCallbackArgumentType == 1 && variant.is<int>() && variant.is<double>()) {
        int value = doc["value"];
        debugVerbose("Called Actuation for Asset:", ' ');
        debugVerbose(actuationCallback->asset, ',');
        debugVerbose(" Payload Type: Integer, Value:", ' ');
        debugVerbose(value);
        reinterpret_cast<void (*)(int payload)>(actuationCallback->actuationCallback)(value);
        return;
    }

    // DOUBLE
    if (actuationCallback->actuationCallbackArgumentType == 2 && variant.is<double>()) {
        double value = doc["value"];
        debugVerbose("Called Actuation for Asset:", ' ');
        debugVerbose(actuationCallback->asset, ',');
        debugVerbose(" Payload Type: Double, Value:", ' ');
        debugVerbose(value);
        reinterpret_cast<void (*)(double payload)>(actuationCallback->actuationCallback)(value);
        return;
    }

    // FLOAT
    if (actuationCallback->actuationCallbackArgumentType == 3 && variant.is<float>()) {
        float value = doc["value"];
        debugVerbose("Called Actuation for Asset:", ' ');
        debugVerbose(actuationCallback->asset, ',');
        debugVerbose(" Payload Type: Float, Value:", ' ');
        debugVerbose(value);
        reinterpret_cast<void (*)(float payload)>(actuationCallback->actuationCallback)(value);
        return;
    }
    
    // CONST CHAR*
    if (actuationCallback->actuationCallbackArgumentType == 4 && variant.is<char*>()) {
        const char* value = doc["value"];
        debugVerbose("Called Actuation for Asset:", ' ');
        debugVerbose(actuationCallback->asset, ',');
        debugVerbose(" Payload Type: const char*, Value:", ' ');
        debugVerbose(value);
        reinterpret_cast<void (*)(const char* payload)>(actuationCallback->actuationCallback)(value);
        return;
    }
    
    // STRING
    if (actuationCallback->actuationCallbackArgumentType == 5 && variant.is<char*>()) {
        String value = doc["value"];
        debugVerbose("Called Actuation for Asset:", ' ');
        debugVerbose(actuationCallback->asset, ',');
        debugVerbose(" Payload Type: String, Value:", ' ');
        debugVerbose(value);
        reinterpret_cast<void (*)(String payload)>(actuationCallback->actuationCallback)(value);
        return;
    }
    
    // JSON ARRAY
    if (variant.is<JsonArray>()) {
        debug("Receiving Arrays is not yet supported!");
        return;
    }
    
    // JSON OBJECT
    if (variant.is<JsonObject>()) {
        debug("Receiving Objects is not yet supported!");
        return;
    }
}

// void actuation(Location location) {
    // Serial.println(location.latitude);
// }

// Send data as CBOR
bool Device::send(CborPayload &payload) {
    if (WiFi.status() == WL_CONNECTED) {
        if (client.connected()) {
            char topic[128];
            snprintf(topic, sizeof topic, "%s%s%s", "device/", deviceCreds->getDeviceId(), "/state");
            client.publish(topic, payload.getBytes(), payload.getSize());
            debug("> Message Published to AllThingsTalk (CBOR)");
            return true;
        } else {
            debug("Can't publish message because you're not connected to AllThingsTalk");
            return false;
        }
    } else {
        debug("Can't publish message because you're not connected to WiFi");
        return false;
    }
}

// Send data as Binary Payload
bool Device::send(BinaryPayload &payload) {
    if (WiFi.status() == WL_CONNECTED) {
        if (client.connected()) {
            char topic[128];
            snprintf(topic, sizeof topic, "%s%s%s", "device/", deviceCreds->getDeviceId(), "/state");
            client.publish(topic, payload.getBytes(), payload.getSize());
            debug("> Message Published to AllThingsTalk (Binary Payload)");
            return true;
        } else {
            debug("Can't publish message because you're not connected to AllThingsTalk");
            return false;
        }
    } else {
        debug("Can't publish message because you're not connected to WiFi");
        return false;
    }
}

template<typename T> bool Device::send(char *asset, T payload) {
    if (WiFi.status() == WL_CONNECTED) {
        if (client.connected()) {
            char topic[128];
            snprintf(topic, sizeof topic, "%s%s%s%s%s", "device/", deviceCreds->getDeviceId(), "/asset/", asset, "/state");
            DynamicJsonDocument doc(256);
            char JSONmessageBuffer[256];
            doc["value"] = payload;
            serializeJson(doc, JSONmessageBuffer);
            client.publish(topic, JSONmessageBuffer, false);
            debug("> Message Published to AllThingsTalk (JSON)");
            debugVerbose("Asset:", ' ');
            debugVerbose(asset, ',');
            debugVerbose(" Value:", ' ');
            debugVerbose(payload);
            return true;
        } else {
            debug("Can't publish message because you're not connected to AllThingsTalk");
            return false;
        }
    } else {
        debug("Can't publish message because you're not connected to WiFi");
        return false;
    }
}

template bool Device::send(char *asset, bool payload);
template bool Device::send(char *asset, char *payload);
template bool Device::send(char *asset, const char *payload);
template bool Device::send(char *asset, String payload);
template bool Device::send(char *asset, int payload);
template bool Device::send(char *asset, byte payload);
template bool Device::send(char *asset, short payload);
template bool Device::send(char *asset, long payload);
template bool Device::send(char *asset, float payload);
template bool Device::send(char *asset, double payload);
